{
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "flight",
    "1": "airfare",
    "2": "airline",
    "3": "ground_service",
    "4": "quantity",
    "5": "city",
    "6": "airfare#flight",
    "7": "abbreviation",
    "8": "aircraft",
    "9": "distance",
    "10": "ground_fare",
    "11": "capacity",
    "12": "flight_time",
    "13": "meal",
    "14": "flight#flight_time",
    "15": "aircraft#flight#flight_no",
    "16": "city#flight_time",
    "17": "restriction",
    "18": "flight_no",
    "19": "airport",
    "20": "flight_no#flight_time",
    "21": "flight#flight_no",
    "22": "airline#flight_no",
    "23": "ground_fare#ground_service",
    "24": "aircraft#flight",
    "25": "airline#flight"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "abbreviation": 7,
    "aircraft": 8,
    "aircraft#flight": 24,
    "aircraft#flight#flight_no": 15,
    "airfare": 1,
    "airfare#flight": 6,
    "airline": 2,
    "airline#flight": 25,
    "airline#flight_no": 22,
    "airport": 19,
    "capacity": 11,
    "city": 5,
    "city#flight_time": 16,
    "distance": 9,
    "flight": 0,
    "flight#flight_no": 21,
    "flight#flight_time": 14,
    "flight_no": 18,
    "flight_no#flight_time": 20,
    "flight_time": 12,
    "ground_fare": 10,
    "ground_fare#ground_service": 23,
    "ground_service": 3,
    "meal": 13,
    "quantity": 4,
    "restriction": 17
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 258,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "tokenizer_class": "PhobertTokenizer",
  "torch_dtype": "float32",
  "transformers_version": "4.53.2",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 64001
}
